
db = {
  'age': {
    'иван сергеевич': 42,
    'демьян исаакович': 33
  },
  'cities': {
    'москва': 2562,
    'тюмень': 698,
    'тверь': 152,
  },
}

db_tree = [
  {
    'id':'age', 
    'children': [
      {'id': 'иван сергеевич', 'children': [{'id': 42}]},
      {'id': 'демьян исаакович', 'children': [{'id': 33}]},
    ]
  },
  {
    'id':'cities', 
    'children': [
      {'id': 'москва', 'children': [{'id': 2562}]},
      {'id': 'тюмень', 'children': [{'id': 698}]},
      {'id': 'тверь', 'children': [{'id': 152}]},
    ]
  },
]